<a href="https://colab.research.google.com/github/BingHungLee/BHAI-Daily-Practice/blob/main/%5B20210707%5D_Pandas_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## [Pandas](https://pandas.pydata.org/pandas-docs/stable/#0)

In [1]:
import pandas as pd

# The inital set of baby names and bith rates
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel', 'Jim']
births = [968, 155, 77, 578, 973, 968 ]

BabyDataSet = list(zip(names, births))
BabyDataSet

[('Bob', 968),
 ('Jessica', 155),
 ('Mary', 77),
 ('John', 578),
 ('Mel', 973),
 ('Jim', 968)]

In [2]:
df = pd.DataFrame(BabyDataSet, columns=['Names', 'Births'])
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973
5      Jim     968

In [4]:
df = pd.DataFrame({'Names':names, 'Births':births})
df

     Names  Births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973
5      Jim     968

In [5]:
df = pd.DataFrame({
   'names': ['Bob','Jessica','Mary','John','Mel'],
   'births': [968, 155, 77, 578, 973]
})  #照columns字母順序排列
df

     names  births
0      Bob     968
1  Jessica     155
2     Mary      77
3     John     578
4      Mel     973

In [6]:
#將資料儲存成 csv
df.to_csv("birth_data.csv", index = True)

In [7]:
#讀取 csv
df = pd.read_csv("birth_data.csv")

In [8]:
## 觀察前五列
df.head()

   Unnamed: 0    names  births
0           0      Bob     968
1           1  Jessica     155
2           2     Mary      77
3           3     John     578
4           4      Mel     973

In [9]:
import numpy as np
# # set seed
np.random.seed(111)

# Function to generate test data
def CreateDataSet(Number=1):
    Output = []
    for i in range(Number):
        # Create a weekly (mondays) date range
        rng = pd.date_range(start='1/1/2009', end='12/31/2012', freq='W-MON') #random number generator
        
        # Create random data
        data = np.random.randint(low=25, high=1000, size=len(rng))
        
        # Status pool
        status = [1,2,3]
        
        # Make a random list of statuses
        random_status = [status[np.random.randint(low=0, high=len(status))] for i in range(len(rng))]
        
        # State pool
        states = ['GA','FL','fl','NY','NJ','TX']
        
        # Make a random list of states 
        random_states = [states[np.random.randint(low=0, high=len(states))] for i in range(len(rng))]
    
        Output.extend(zip(random_states, random_status, data, rng))
        #extend& append 差異
        
    return Output

In [10]:
dataset = CreateDataSet(3)
dataset
len(dataset) #check shape
df = pd.DataFrame(data=dataset, columns=['State','Status','CustomerCount','StatusDate'])
df.head(10)

  State  Status  CustomerCount StatusDate
0    GA       1            877 2009-01-05
1    FL       1            901 2009-01-12
2    fl       3            749 2009-01-19
3    FL       3            111 2009-01-26
4    GA       1            300 2009-02-02
5    FL       2            706 2009-02-09
6    TX       3            347 2009-02-16
7    fl       2            143 2009-02-23
8    FL       3            833 2009-03-02
9    NY       1            992 2009-03-09

In [11]:
df["State"].unique()

array(['GA', 'FL', 'fl', 'TX', 'NY', 'NJ'], dtype=object)

In [12]:
df["State"].unique().shape

(6,)

In [13]:
df["State"]

0      GA
1      FL
2      fl
3      FL
4      GA
       ..
622    NY
623    GA
624    NJ
625    GA
626    FL
Name: State, Length: 627, dtype: object

In [14]:
df.shape

(627, 4)

In [16]:
len(dataset)

627

In [17]:
df['State'].value_counts()

fl    111
GA    108
TX    104
FL    103
NJ    101
NY    100
Name: State, dtype: int64

In [18]:
df.info()
#check is there any missing data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 627 entries, 0 to 626
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   State          627 non-null    object
 1   Status         627 non-null    int64
 2   CustomerCount  627 non-null    int64
 3   StatusDate     627 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 19.7+ KB

In [19]:
df.columns

Index(['State', 'Status', 'CustomerCount', 'StatusDate'], dtype='object')

In [20]:
print(df["CustomerCount"].head(5))
print(type(df["CustomerCount"]))

0    877
1    901
2    749
3    111
4    300
Name: CustomerCount, dtype: int64
<class 'pandas.core.series.Series'>

In [21]:
print(df[["CustomerCount"]].head(5))
print(type(df[["CustomerCount"]]))

   CustomerCount
0            877
1            901
2            749
3            111
4            300
<class 'pandas.core.frame.DataFrame'>

In [22]:
#slicing 取得第2個到第8個
print(df[2:9])

  State  Status  CustomerCount StatusDate
2    fl       3            749 2009-01-19
3    FL       3            111 2009-01-26
4    GA       1            300 2009-02-02
5    FL       2            706 2009-02-09
6    TX       3            347 2009-02-16
7    fl       2            143 2009-02-23
8    FL       3            833 2009-03-02

## slicing with pandas - loc

In [23]:
# select specific row
print(df.loc[0:3])

  State  Status  CustomerCount StatusDate
0    GA       1            877 2009-01-05
1    FL       1            901 2009-01-12
2    fl       3            749 2009-01-19
3    FL       3            111 2009-01-26

In [24]:
# subset all row and specific columns
print(df.loc[:,["State", "Status"]].head())

  State  Status
0    GA       1
1    FL       1
2    fl       3
3    FL       3
4    GA       1

In [25]:
print(df.loc[0:5,"State"])

0    GA
1    FL
2    fl
3    FL
4    GA
5    FL
Name: State, dtype: object

## Slicing with Pandas -iloc
The difference between loc and iloc?

In [28]:
#row access
print(df.iloc[0:7])

  State  Status  CustomerCount StatusDate
0    GA       1            877 2009-01-05
1    FL       1            901 2009-01-12
2    fl       3            749 2009-01-19
3    FL       3            111 2009-01-26
4    GA       1            300 2009-02-02
5    FL       2            706 2009-02-09
6    TX       3            347 2009-02-16

In [27]:
print(df.iloc[:,2].head())
print(df.iloc[:,2].head().values)

0    877
1    901
2    749
3    111
4    300
Name: CustomerCount, dtype: int64
[877 901 749 111 300]

In [29]:
print(df.iloc[1:5,[2,3]])

   CustomerCount StatusDate
1            901 2009-01-12
2            749 2009-01-19
3            111 2009-01-26
4            300 2009-02-02

## conditional data

In [31]:
df.loc[df.State == 'FL'].head(10)

   State  Status  CustomerCount StatusDate
1     FL       1            901 2009-01-12
3     FL       3            111 2009-01-26
5     FL       2            706 2009-02-09
8     FL       3            833 2009-03-02
22    FL       2            737 2009-06-08
28    FL       1            710 2009-07-20
35    FL       3            587 2009-09-07
42    FL       3            930 2009-10-26
43    FL       3            195 2009-11-02
49    FL       3            510 2009-12-14

In [33]:
df.loc[(df.State == 'FL') & (df['Status'] == 3)].head(10)

    State  Status  CustomerCount StatusDate
3      FL       3            111 2009-01-26
8      FL       3            833 2009-03-02
35     FL       3            587 2009-09-07
42     FL       3            930 2009-10-26
43     FL       3            195 2009-11-02
49     FL       3            510 2009-12-14
150    FL       3            847 2011-11-21
160    FL       3            883 2012-01-30
166    FL       3            109 2012-03-12
204    FL       3            222 2012-12-03

In [34]:
print((df['Status'] + 1).head())

0    2
1    2
2    4
3    4
4    2
Name: Status, dtype: int64

##apply使用

In [35]:
print(df.apply(len, axis=0))

State            627
Status           627
CustomerCount    627
StatusDate       627
dtype: int64

In [37]:
print(df.apply(len, axis=1))  
# axis = 0 --> each column
# axis = 1 --> each row

0      4
1      4
2      4
3      4
4      4
      ..
622    4
623    4
624    4
625    4
626    4
Length: 627, dtype: int64

In [38]:
def text(df):
    status = df['Status']
    return 'correct' if status == 1 else 'error'

df['StatusText'] = df.apply(text, axis=1)

In [39]:
g_state = df.groupby(['State'], axis=0)
g_state.size()
g_state.groups

{'FL': [1, 3, 5, 8, 22, 28, 35, 42, 43, 49, 52, 60, 61, 69, 89, 95, 96, 97, 100, 108, 112, 127, 143, 150, 159, 160, 163, 165, 166, 170, 171, 173, 194, 195, 204, 207, 208, 232, 234, 244, 248, 260, 267, 271, 278, 281, 287, 290, 294, 300, 303, 307, 311, 320, 323, 325, 332, 333, 339, 343, 376, 381, 390, 398, 402, 403, 405, 406, 409, 410, 415, 418, 437, 444, 451, 464, 467, 468, 471, 483, 488, 490, 494, 495, 496, 498, 504, 506, 511, 519, 528, 541, 544, 550, 551, 555, 565, 576, 579, 580, ...], 'GA': [0, 4, 12, 17, 21, 24, 25, 31, 48, 57, 59, 71, 78, 88, 94, 102, 110, 120, 124, 130, 131, 133, 145, 154, 155, 161, 162, 169, 184, 190, 200, 215, 220, 230, 246, 251, 254, 255, 256, 257, 263, 266, 280, 296, 304, 306, 309, 314, 315, 317, 326, 335, 345, 349, 353, 355, 359, 366, 368, 370, 371, 379, 387, 391, 394, 411, 412, 413, 419, 424, 427, 431, 433, 435, 438, 443, 450, 454, 462, 475, 476, 478, 480, 481, 489, 492, 493, 501, 503, 509, 512, 514, 515, 516, 526, 530, 531, 532, 540, 571, ...], 'NJ': [15, 16, 23, 29, 36, 38, 45, 46, 50, 53, 62, 64, 66, 68, 75, 82, 86, 87, 105, 109, 113, 116, 118, 119, 122, 123, 146, 158, 182, 189, 193, 198, 199, 201, 202, 203, 205, 206, 218, 235, 237, 238, 243, 252, 253, 264, 275, 284, 289, 299, 302, 313, 329, 338, 347, 348, 354, 358, 361, 363, 377, 378, 395, 401, 421, 423, 425, 426, 430, 434, 445, 446, 448, 455, 456, 463, 469, 470, 473, 479, 484, 486, 505, 508, 523, 553, 561, 562, 568, 570, 577, 584, 593, 595, 602, 609, 611, 612, 619, 620, ...], 'NY': [9, 19, 40, 55, 56, 70, 72, 74, 81, 91, 99, 103, 104, 106, 117, 132, 134, 136, 138, 144, 149, 151, 152, 167, 177, 180, 186, 192, 211, 217, 219, 221, 224, 225, 227, 229, 249, 259, 261, 295, 301, 308, 318, 321, 327, 328, 342, 344, 346, 351, 360, 365, 369, 374, 385, 389, 392, 396, 399, 400, 414, 416, 436, 442, 447, 458, 472, 485, 500, 502, 507, 513, 517, 520, 521, 524, 527, 533, 535, 538, 539, 542, 543, 556, 564, 567, 569, 573, 574, 582, 588, 592, 594, 596, 604, 606, 610, 615, 618, 622], 'TX': [6, 11, 20, 30, 32, 41, 44, 58, 65, 73, 77, 80, 83, 84, 85, 92, 93, 101, 107, 114, 121, 137, 139, 140, 156, 157, 164, 168, 178, 185, 188, 191, 213, 226, 228, 231, 233, 239, 240, 241, 242, 245, 250, 268, 269, 274, 276, 279, 282, 283, 285, 286, 291, 319, 322, 324, 330, 334, 336, 340, 350, 352, 357, 362, 364, 367, 375, 380, 382, 383, 386, 404, 407, 408, 420, 432, 439, 441, 452, 457, 459, 460, 474, 482, 487, 522, 529, 534, 536, 537, 545, 548, 554, 566, 578, 586, 597, 599, 600, 603, ...], 'fl': [2, 7, 10, 13, 14, 18, 26, 27, 33, 34, 37, 39, 47, 51, 54, 63, 67, 76, 79, 90, 98, 111, 115, 125, 126, 128, 129, 135, 141, 142, 147, 148, 153, 172, 174, 175, 176, 179, 181, 183, 187, 196, 197, 209, 210, 212, 214, 216, 222, 223, 236, 247, 258, 262, 265, 270, 272, 273, 277, 288, 292, 293, 297, 298, 305, 310, 312, 316, 331, 337, 341, 356, 372, 373, 384, 388, 393, 397, 417, 422, 428, 429, 440, 449, 453, 461, 465, 466, 477, 491, 497, 499, 510, 518, 525, 546, 547, 549, 552, 557, ...]}

In [40]:
g_state.get_group("NJ")

    State  Status  CustomerCount StatusDate StatusText
15     NJ       2            905 2009-04-20      error
16     NJ       1            753 2009-04-27    correct
23     NJ       3             62 2009-06-15      error
29     NJ       1            990 2009-07-27    correct
36     NJ       1            772 2009-09-14    correct
..    ...     ...            ...        ...        ...
611    NJ       3            529 2012-09-17      error
612    NJ       2            693 2012-09-24      error
619    NJ       3            201 2012-11-12      error
620    NJ       2            962 2012-11-19      error
624    NJ       3            874 2012-12-17      error

[101 rows x 5 columns]

In [41]:
g_state.sum()/g_state.count()

       CustomerCount    Status  StatusDate  StatusText
State
FL        519.912621  1.932039         NaN         NaN
GA        486.518519  2.037037         NaN         NaN
NJ        555.306931  2.089109         NaN         NaN
NY        513.500000  1.910000         NaN         NaN
TX        454.000000  2.067308         NaN         NaN
fl        517.054054  1.981982         NaN         NaN

In [42]:
g_state = df.groupby(['StatusDate','State'], axis=0, sort=True).sum()
g_state

                  Status  CustomerCount
StatusDate State
2009-01-05 FL          3            638
           GA          1            877
           fl          3            122
2009-01-12 FL          1            901
           GA          3            813
...                  ...            ...
2012-12-24 FL          2            969
           GA          3            668
           NY          3            850
2012-12-31 FL          6           1594
           fl          2            334

[535 rows x 2 columns]

## pd.concat ** 將兩個 df 連接

In [44]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
           'B': ['B0', 'B1', 'B2', 'B3'],
           'C': ['C0', 'C1', 'C2', 'C3'],
           'D': ['D0', 'D1', 'D2', 'D3']},
           index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
           'B': ['B4', 'B5', 'B6', 'B7'],
           'C': ['C4', 'C5', 'C6', 'C7'],
           'D': ['D4', 'D5', 'D6', 'D7']},
           index=[4, 5, 6, 7])

In [45]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [46]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [48]:
## 垂直接上 dataframe
result = pd.concat([df1, df2], axis = 0) #default = 0
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [49]:
## 垂直接上 dataframe
result = pd.concat([df1, df2], axis = 1)
result

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [50]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
            'A': ['A0', 'A1', 'A2', 'A3'],
            'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
            'C': ['C0', 'C1', 'C2', 'C3'],
            'D': ['D0', 'D1', 'D2', 'D3']})

In [51]:
result = pd.merge(left, right, on = 'key')
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [52]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
            'key2': ['K0', 'K1', 'K0', 'K1'],
            'A': ['A0', 'A1', 'A2', 'A3'],
            'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
            'key2': ['K0', 'K0', 'K0', 'K0'],
            'C': ['C0', 'C1', 'C2', 'C3'],
            'D': ['D0', 'D1', 'D2', 'D3']})

In [53]:
result = pd.merge(left, right, on=['key1', 'key2'], how='left')
result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [54]:
result = pd.merge(left, right, how='right', on=['key1', 'key2'])
result

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [55]:
result = pd.merge(left, right, how='outer', on=['key1', 'key2'])
result

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [56]:
result = pd.merge(left, right, how='inner', on=['key1', 'key2'])
result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

## pandas 練習

* [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
* [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
* [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
* [cookbook and idioms](http://pandas.pydata.org/pandas-docs/version/0.17.0/cookbook.html#cookbook)
* [Guilherme Samora's pandas exercises](https://github.com/guipsamora/pandas_exercises)